Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet Properties
The StraightDimensionSet type exposes the following members.
Properties
Name | Description
Attributes
 The straight dimension set attributes.
Distance
 The distance from the first dimension point to the dimension line. The distance is measured in paper millimeters.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from DimensionSetBase.)
LeftTagLineOffset
 The offset of the left tag line. The offset is measured in paper millimeters.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
RightTagLineOffset
 The offset of the right tag line. The offset is measured in paper millimeters.
Top
See Also
Reference
StraightDimensionSet Class
Tekla.Structures.Drawing Namespace